# Practica 1 - Pandas

In [2]:
import pandas as pd

In [3]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|', index_col='user_id')
users

## Ej 1: Muestra las primeras 25 filas. 

Resuelve este ejercicio de dos formas (o m√°s).

In [4]:
users.head(n = 25)

In [5]:
users[0:25]

## Ej 2: Muestra las ultimas 15 filas

In [9]:
users.tail(n = 15)

         age gender     occupation zip_code
user_id
929       44      M      scientist    53711
930       28      F      scientist    07310
931       60      M       educator    33556
932       58      M       educator    06437
933       28      M        student    48105
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [10]:
users[-1:-16:-1]

         age gender     occupation zip_code
user_id
943       22      M        student    77841
942       48      F      librarian    78209
941       20      M        student    97229
940       32      M  administrator    02215
939       26      F        student    33319
938       38      F     technician    55038
937       48      M       educator    98072
936       24      M          other    32789
935       42      M         doctor    66221
934       61      M       engineer    22902
933       28      M        student    48105
932       58      M       educator    06437
931       60      M       educator    33556
930       28      F      scientist    07310
929       44      M      scientist    53711

## Ej 3: ¬øCuantas observaciones (o filas) hay en este dataframe?

Resuelve este ejercicio de dos formas (o m√°s)

In [14]:
len(users.index)

943

In [15]:
len(users)

943

In [21]:
users.shape[0]

943

In [22]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

## Ej 4: ¬øCuantas columnas hay en este dataframe?

Resuelve este ejercicio de dos formas (o m√°s)

In [23]:
len(users.columns)

4

In [26]:
len(users.axes[1])

4

In [27]:
users.shape[1]

4

## Ej 5: Obt√©n una lista con el nombre de las columnas del dataframe

In [28]:
users.axes[1]

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [29]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

## Ej 6: Obten el indice del Dataframe

In [30]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

## Ej 7: Muestra los tipos de datos de las columnas

Resuelve este ejercicio de dos formas (o m√°s)

In [32]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [33]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [34]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [35]:
users.isnull().any()

age           False
gender        False
occupation    False
zip_code      False
dtype: bool

## Ej 8: Obten todos los valores de la columna occupation

Resuelve este ejercicio de dos formas (o m√°s)

In [40]:
users[['occupation']]

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

In [41]:
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [48]:
pd.DataFrame(users.iloc[:,2])

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

## Ej 9: Obt√©n el n√∫mero de ocupaciones diferentes que hay en el dataset y el n√∫mero de usuarios por ocupaci√≥n que hay en el dataframe

In [49]:
len(users.occupation.unique())

21

In [60]:
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [52]:
users = users.reset_index()

In [68]:
users.groupby('occupation')['occupation'].count()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

## Ej 10: Cual es la ocupaci√≥n m√°s frecuente?

In [74]:
topoccup = pd.DataFrame(users.groupby('occupation')['occupation'].count())

In [69]:
users['occupation'].describe()

'student'

In [79]:
users['occupation'].value_counts().idxmax()

'student'

In [78]:
users['occupation'].value_counts().keys()[0]

'student'

## Ej 11: Haz un resumen estadistico del dataset.

In [75]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

## Ej 12: Calcula la media de edad de los usuarios por ocupaci√≥n.

In [86]:
users.groupby('occupation')[['age']].mean().sort_values(by = 'age',ascending=False).round(decimals=2)

                 age
occupation
retired        63.07
doctor         43.57
educator       42.01
healthcare     41.56
librarian      40.00
administrator  38.75
executive      38.72
marketing      37.62
lawyer         36.75
engineer       36.39
writer         36.31
salesman       35.67
scientist      35.55
other          34.52
technician     33.15
programmer     33.12
homemaker      32.57
artist         31.39
entertainment  29.22
none           26.56
student        22.08

## Ej 13: cual es la edad menos frecuente en el dataset?

In [89]:
topage = pd.DataFrame(users['age'].value_counts())

In [98]:
users['age'].value_counts().min()

1

In [99]:
topage[topage['age'] == users['age'].value_counts().min()]

    age
7     1
66    1
11    1
10    1
73    1